### Analysis of retail sales figures
This notebook will analyzing retail sales figures from Jan 2020 to March 2025. I calculate a moving average, average and year over year.

In [47]:
import pandas as pd
import os

In [48]:
sales_data = pd.read_csv('../data/retail_sales_cleaned.csv')

In [49]:
#trying to see what I am working with. if the cleaned data set is good.

sales_data.head()

     Period    Value
0  Jan-2020  525,411
1  Feb-2020  525,380
2  Mar-2020  477,676
3  Apr-2020  408,312
4  May-2020  484,978

In [50]:
len(sales_data)

63

In [51]:
#Next step is seeing what data types are in the columns.

sales_data.dtypes

Period    object
Value     object
dtype: object

In [52]:
#is it a string?

sales_data['Value'].apply(type).value_counts()

Value
<class 'str'>    63
Name: count, dtype: int64

In [53]:
#making it into a number here

sales_data['Value'] = sales_data['Value'].str.replace(',', '').astype(float)

In [54]:
sales_data.head()

     Period     Value
0  Jan-2020  525411.0
1  Feb-2020  525380.0
2  Mar-2020  477676.0
3  Apr-2020  408312.0
4  May-2020  484978.0

In [55]:
#Double checking.

sales_data.dtypes

Period     object
Value     float64
dtype: object

In [56]:
sales_data['Value'].apply(type).value_counts()

Value
<class 'float'>    63
Name: count, dtype: int64

In [57]:
#now that i have my numbers, I want to calculate the moving average and average itself to see trends and compare.
#will create a new column here 
#came across the rolling function on Google

sales_data['Three-Month-MA'] = sales_data['Value'].rolling(window=3).mean()

In [58]:
sales_data.head()

     Period     Value  Three-Month-MA
0  Jan-2020  525411.0             NaN
1  Feb-2020  525380.0             NaN
2  Mar-2020  477676.0   509489.000000
3  Apr-2020  408312.0   470456.000000
4  May-2020  484978.0   456988.666667

In [59]:
sales_data.tail()

      Period     Value  Three-Month-MA
58  Nov-2024  725079.0   720620.000000
59  Dec-2024  730336.0   725269.333333
60  Jan-2025  722944.0   726119.666667
61  Feb-2025  724535.0   725938.333333
62  Mar-2025  734870.0   727449.666667

In [60]:
average = sales_data['Value'].mean()
print("Average monthly sales: ", average)

Average monthly sales:  644411.4444444445

In [61]:
#Question to answer. How many months were above and below average?

sales_data['Above Average'] = sales_data['Value'] > average

In [62]:
sales_data.head()

     Period     Value  Three-Month-MA  Above Average
0  Jan-2020  525411.0             NaN          False
1  Feb-2020  525380.0             NaN          False
2  Mar-2020  477676.0   509489.000000          False
3  Apr-2020  408312.0   470456.000000          False
4  May-2020  484978.0   456988.666667          False

In [63]:
sales_data.tail()

      Period     Value  Three-Month-MA  Above Average
58  Nov-2024  725079.0   720620.000000           True
59  Dec-2024  730336.0   725269.333333           True
60  Jan-2025  722944.0   726119.666667           True
61  Feb-2025  724535.0   725938.333333           True
62  Mar-2025  734870.0   727449.666667           True

In [64]:
sales_data['Above Average'].value_counts()

Above Average
True     38
False    25
Name: count, dtype: int64

In [65]:
#Next analysis is year over year.
#After running first, an error popped up. Turns out I mispelled change in the formula.

sales_data['Year over Year'] = sales_data['Value'].pct_change(periods=12) * 100

In [66]:
sales_data.head()

     Period     Value  Three-Month-MA  Above Average  Year over Year
0  Jan-2020  525411.0             NaN          False             NaN
1  Feb-2020  525380.0             NaN          False             NaN
2  Mar-2020  477676.0   509489.000000          False             NaN
3  Apr-2020  408312.0   470456.000000          False             NaN
4  May-2020  484978.0   456988.666667          False             NaN

In [67]:
sales_data.tail()

      Period     Value  Three-Month-MA  Above Average  Year over Year
58  Nov-2024  725079.0   720620.000000           True        4.003632
59  Dec-2024  730336.0   725269.333333           True        4.360401
60  Jan-2025  722944.0   726119.666667           True        4.150946
61  Feb-2025  724535.0   725938.333333           True        3.543607
62  Mar-2025  734870.0   727449.666667           True        4.604851

In [68]:
#Rounding the numbers to make them easier to read.

sales_data = sales_data.round(2)

In [69]:
sales_data.tail()

      Period     Value  Three-Month-MA  Above Average  Year over Year
58  Nov-2024  725079.0       720620.00           True            4.00
59  Dec-2024  730336.0       725269.33           True            4.36
60  Jan-2025  722944.0       726119.67           True            4.15
61  Feb-2025  724535.0       725938.33           True            3.54
62  Mar-2025  734870.0       727449.67           True            4.60

In [70]:
os.makedirs("../output", exist_ok=True)

In [71]:
sales_data.to_csv("../output/retail_sales_analysis.csv", index=False)